meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "BRAINROT": "человек которыю исползует кринжовые слова",
            "РОФЛ": "шутка",
            "ГГ" : "хорошая игра (good game)",
            "ПОФ": "ситуацыя которая у всех происходит",
            }
for i in range(6):
    word = input("Введите непонятное слово (большими буквами!): ")

    if word in meme_dict.keys():
        print(meme_dict[word])
    # Что делать, если слово нашлось?
    else:
        print("такого слого нет")
    # Что делать, если слово не нашлось
